import {Header} from "../Header/Header";
import {Footer} from "../Footer/Footer";

export const PolicyPage = (props) => {

  return(
    <div className="main-wrapper">
      <Header/>
      <main>
        <section className="sPolicy section">
          <div className="sPolicy__container container">
            <h1>ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ О ПРЕДОСТАВЛЕНИИ УСЛУГ</h1>
            <div className="sPolicy__box">
              1. СРОКИ<br/>
              <br/>
              1.1. Публичная оферта – формальное предложение Исполнителя (изложенная на Сайте Исполнителя), адресованная
              неограниченному кругу физических лиц заключить Договор на определенных условиях.<br/>
              1.2. Cайт Исполнителя – веб-страница в сети Интернет по адресу <a href="/"
                                                                                target="_blank">https://bro-gamers.com/</a> ,
              который является основным источником информирования Заказчиков.<br/>
              1.3. Акцепт – полное, безусловное и безоговорочное принятие Клиентом условий Публичной оферты, настоящего
              Договора.<br/>
              Акцепт может быть осуществлен одним из способов:<br/>
              – заполнение, подписание и передача Клиентом Исполнителю письменного Акцепта, образец которого находится
              на сайте Исполнителя<br/>
              – перечисление денежных средств на банковский счет Исполнителя в качестве оплаты за соответствующие
              услуги.<br/>
              1.4. Клиент, Заказчик – физическое лицо, акцептовали Публичную оферту Исполнителя, изложенную в настоящем
              Договоре, оплатила стоимость соответствующего любого пакета услуг.<br/>
              1.5. Все рекламные, презентационные и другие материалы, созданы и существуют с целью информирования об
              услугах Исполнителя, носят только информационно-справочный характер и не является источником
              урегулирования всех условий предоставления услуг.<br/>
              <br/>
              2. ПРЕДМЕТ ДОГОВОРА И ОПЛАТА УСЛУГ<br/>
              <br/>
              2.1. Эта Публичная оферта (Договор) определяет особенности предоставления услуг технического-рекламного
              обслуживания Заказчика (клиента). Исполнитель предоставляет услугу Заказчику в соответствии с Пакета
              услуг.<br/>
              2.2. Заказчик своевременно и в полном объеме оплачивает стоимость оказанных ему услуг, согласно тарифам,
              установленным Исполнителем в соответствии с Пакета услуг. Стоимость услуг определяется в выставленном
              Исполнителем счета или Акте предоставленных услуг.<br/>
              2.3. Стоимость услуг по настоящему Договору размещается на официальном сайте Исполнителя.<br/>
              2.4. Услуги предоставляются с момента Акцепта Клиентом условий и положений настоящего Договора.<br/>
              2.5. Местом оказания услуг считается местонахождение Исполнителя (территория города Львов).<br/>
              2.6. Клиент платит Услуги путем перечисления денежных средств за услуги на текущий счет Исполнителя.<br/>
              2.7. Исполнитель имеет право в одностороннем порядке изменять тарифы на услуги. Информацию о таких
              изменениях Исполнитель публикует на своем официальном сайте.<br/>
              <br/>
              3. ПРАВА И ОБЯЗАННОСТИ СТОРОН<br/>
              <br/>
              3.1. Заказчик имеет право:<br/>
              3.1.1. Получать необходимую и достоверную информацию о Исполнителя, объем предоставленных им услуг, а
              также другую информацию, связанную с оказанием услуг.<br/>
              3.1.2. Обращаться к Исполнителю с новаторскими предложениями по улучшению процесса предоставления услуг
              Привилегий.<br/>
              3.2. Заказчик обязуется:<br/>
              3.2.1. Предоставлять полную и достоверную информацию, необходимую для идентификации Заказчика.<br/>
              3.2.2. При обращении к Исполнителю за оказанием услуг, не нарушать требований действующего
              законодательства и принятых общество норм морали и нравственности, не использовать результаты оказания
              услуг Исполнителем в противоправных целях, в результате чего могут быть нарушены права и законные интересы
              Исполнителя и / или третьих лиц.<br/>
              3.2.3. Вносить плату согласно условиям настоящего договора.<br/>
              3.2.4. При присоединении к данной Публичной оферты Заказчик дает согласие Исполнителю на использование его
              персональных данных в рамках Закона Украины «О защите персональных данных».<br/>
              3.3. Исполнитель имеет право:<br/>
              3.3.1. Привлекать для осуществления своих обязанностей третьих лиц, имеющих необходимую квалификацию для
              предоставления конкретного вида услуги.<br/>
              3.3.2. Проверять предоставленную Заказчиком информацию, а также выполнение Заказчиком условий
              Договора.<br/>
              3.3.3. Отказать Заказчику в предоставлении услуг в случаях, если:<br/>
              – Клиент нарушил свои обязательства по условиям Договора<br/>
              – Клиент использует результаты оказанных услуг в противоправных целях, вредит или может повредить правам и
              законным интересам Исполнителя и / или третьих лиц.<br/>
              3.4. Исполнитель обязуется:<br/>
              3.4.1. Обеспечивать Заказчику возможность получения услуг надлежащего качества в соответствии с настоящим
              Договором и Правилами предоставления соответствующих услуг.<br/>
              3.4.2. Обеспечивать Клиенту возможность получения информации по вопросам предоставления услуг.<br/>
              3.4.3. Обеспечивать Заказчику возможность получения им услуг.<br/>
              3.4.4. Принимать к рассмотрению рационализаторских предложения Клиентов по улучшению и качества
              предоставления услуг.<br/>
              3.4.5 Выполнять свои обязательства на время действия гарантий<br/>
              <br/>
              4. ДРУГИЕ УСЛОВИЯ.<br/>
              <br/>
              4.1. Порядок урегулирования споров и применимое право.<br/>
              4.1.1. Все споры и споры, которые могут возникнуть в процессе оказания услуг Исполнителем, в связи с
              принятием, исполнением и / или нарушением положений настоящего Договора и всех приложений к нему,
              регулируются путем переговоров Сторон.<br/>
              4.1.2. В случае недостижения согласия путем переговоров, Заказчик оставляет за собой право на предъявление
              претензий, которые обязательно должны быть рассмотрены Исполнителем в разумные сроки, с целью
              урегулирования споров и споров в досудебном порядке.<br/>
              4.1.3. В случае недостижения согласия между Сторонами путем переговоров и невозможности урегулирования в
              досудебном порядке, все споры и разногласия разрешаются в судебном порядке по месту нахождения
              Исполнителя.<br/>
              4.1.4. К отношениям сторон, вытекающих из принятия и исполнения настоящего Договора и всех приложений к
              нему, применяются действующие нормы и положения законодательства Украины такой мере, в какой это не
              противоречит императивным нормам права Украины.<br/>
              4.2. Ограничение ответственности Исполнителя.<br/>
              4.2.1. Стороны понимают и признают, что несоответствие результата предоставления той или иной услуги
              результата, что ожидал и желал получить Заказчик при обращении за предоставлением соответствующей услуги,
              само по себе не является фактом предоставления такой услуги ненадлежащего качества.<br/>
              4.3. Заключительные положения.<br/>
              4.3.1. Исполнитель оставляет за собой право в любое время в одностороннем порядке вносить изменения к
              настоящему Договору.<br/>
              4.3.2. Все изменения к настоящему Договору публикуются на Сайте Исполнителя.<br/>
              4.3.3. Все изменения к настоящему Договору вступают в силу с момента их опубликования на Сайте
              Исполнителя.<br/>
              4.3.4. Внесены изменения, вступившие в силу, распространяются на всех Заказчиков.<br/>
              4.3.5. Клиенты считаются сообщенным о внесенных в Договор изменения с момента опубликования этих изменений
              на Сайте Исполнителя.<br/>
              4.3.6. Все Приложения к Договору являются неотъемлемыми частями настоящего Договора и являются
              обязательными для их выполнения и соблюдения.<br/>
              <br/>
              5. ОТВЕТСТВЕННОСТЬ СТОРОН<br/>
              <br/>
              5.1. Стороны несут ответственность, предусмотренную действующим законодательством Украины.<br/>
              5.2. Стороны не несут ответственность за нарушение своих обязательств по настоящему Договору, если оно
              произошло не по их вине. Сторона считается невиновным, если докажет, что приняла все зависящие от нее меры
              для надлежащего исполнения обязательства.<br/>
              5.3. Ни одна из Сторон не несет ответственность за неисполнение или ненадлежащее исполнение своих
              обязательств по настоящему Договору, если это неисполнение или ненадлежащее исполнение обусловлены
              действием обстоятельств непреодолимой силы (форс-мажорных обстоятельств).<br/>
              <br/>
              6. СРОК ДЕЙСТВИЯ ДОГОВОРА<br/>
              <br/>
              6.1. Настоящий договор Публичной оферты действует с момента присоединения к нему Заказчика.<br/>
              6.2. Срок действия договора не ограничен.<br/>
              6.3. Клиент вправе расторгнуть настоящий договор при невыполнении его условий Исполнителем или при
              отсутствии необходимости в услугах. О расторжении договора Заказчик обязан письменно уведомить Исполнителя
              за месяц до расторжения.<br/>
              6.4. После размещения настоящего Договора Публичной оферты на сайте Исполнителя все предыдущие
              согласования, которые вступают с ним в противоречие, теряют силу.<br/>
              6.5. В случае необходимости, по желанию Клиента настоящий Договор может быть оформлен в письменной форме.
              Дополнение, оформленные в письменном виде и подписаны сторонами с целью выполнения данного договора,
              является его неотъемлемой частью.<br/>
              <br/>
              7. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ<br/>
              <br/>
              7.1. Этот договор регулируется действующим законодательством Украины.<br/>
              7.2 Исполнитель может проводить аудиозапись всех разговоров с клиентом без дополнительного уведомления
              Заказчика об этом. Данная информация является конфиденциальной.<br/>
              7.3. Исполнитель сохраняет конфиденциальность данных и информации, полученной от Клиента при заключении
              Договора или в ходе его выполнения и может их распространить исключительно в порядке и случаях прямо
              предусмотренных действующим законодательством Украины.<br/>
              7.4. Клиент предоставляет безусловное согласие на хранение и обработку, в том числе автоматизированную,
              любой информации, относящейся к персональным данным Клиента с целью, связанной с выполнением настоящего
              Договора и последствий его выполнения, или невыполнение. Клиент предоставляет Исполнителю свое согласие на
              обработку всех его персональных данных без ограничения срока хранения и срока обработки персональных
              данных.<br/>
              7.5. Признание любого положения или пункта настоящего Договора или приложений к нему не действительным, не
              влияет на действительность остальных положений и условий Договора.<br/>
              <br/>
            </div>
            <h2>Условия возврата/оплаты/доставки</h2>
            <div className="sPolicy__box">
              <br/>
              1. ВСТУПЛЕНИЕ<br/>
              <br/>
              Пользование сайтом <a href="/" target="_blank">https://bro-gamers.com/</a> и другими сайтами проекта
              (далее «Сайт»), а также пользование продуктами и услугами, предлагаемыми на сайте (далее по тексту
              «Товар», за исключением услуг, оказываемых в рамках отдельного письменного договора) регулируется
              условиями юридического соглашения (договора) между Вами (пользователем сайта) и нами — компанией
              «BroGamers» (далее по тексту «Администрацией сайта», «нами» или «мы»).<br/>
              В настоящем документе описаны основные положения этого договора, а также изложены некоторые его
              условия.<br/>
              Если с вами не заключено иного письменного договора или соглашения, то ваш договор с компанией BroGamers
              всегда будет включать в себя по меньшей мере те условия и положения, которые изложены в настоящем
              документе (далее именуются «Общие условия»).<br/>
              <br/>
              2. ПРИНЯТИЕ УСЛОВИЙ<br/>
              <br/>
              Для получения возможности пользования Товарами, вы должны принять Условия. До момента принятия Условий,
              пользование Товарами BroGamers запрещается.<br/>
              Принять Условия можно следующими способами:<br/>
              (А) совершением действия, свидетельствующего о принятии Условий (нажатием на кнопку, проставлением галочки
              в чекбокс или аналогичным действием) на странице заказа товара на сайте;<br/>
              (Б) фактическим использованием Услуг. В этом случае Вы соглашаетесь с тем, что мы будем рассматривать факт
              использования Товаров как принятие Условий.<br/>
              Пользуясь сайтом проекта или предлагаемыми на сайте товарами вы принимаете все указанные Условия. Если вы
              не согласны с настоящими Общими Условиями или Дополнительными Условиями, опубликованными на сайте –
              покиньте сайт и прекратите использовать Услуги.<br/>
              <br/>
              3. ПОЛЬЗОВАНИЕ САЙТОМ И ЗАКАЗ ТОВАРА<br/>
              <br/>
              Пользуясь сайтом или Товарами, вы принимаете настоящие Общие Условия и Положения, а также нашу Политику
              конфиденциальности. Если вы не согласны с содержанием указанных документов, покиньте сайт и прекратите
              пользование товарами.<br/>
              <br/>
              Если вы оформили заказ на предлагаемые на сайте товары, или же пользуетесь нашими товарами, вы
              соглашаетесь с тем, что мы можем направлять вам письменные уведомления, рекламные рассылки, информационные
              сообщения и другие материалы по номеру телефона и email, указанным при регистрации. В отдельных случаях,
              вы можете, при необходимости, отказаться от их получения.<br/>
              <br/>
              Вы должны соблюдать все Условия и правила, с которыми вам будет предложено ознакомиться при оформлении
              заказа или в процессе пользовании товарами, предлагаемыми на сайте. Вы соглашаетесь с тем, что вы не
              будете принимать участие в деятельности, которая нарушает функционирование сайта, Товаров или связанных с
              ними серверов и сетей.<br/>
              Вы принимаете на себя полную ответственность за любые нарушения Ваших обязательств, оговоренных в
              Условиях, а также за все последствия этих нарушений.<br/>
              <br/>
              4. УСЛОВИЯ ОПЛАТЫ<br/>
              <br/>
              Списание средств<br/>
              <br/>
              В случае приобретения товара на сайте, в момент оформления заказа (успешного ввода платежных реквизитов во
              фрейм платежной системы) происходит разовое списание суммы стоимости заказанного товара.<br/>
              <br/>
              Мы оставляем за собой право предъявлять претензии по поводу нарушения установленных сроков оплаты товара.
              В случае невозможности списания денежных средств с вашей платежной карты или очередного платежа, мы имеем
              право не предоставлять товар, до момента их надлежащей оплаты<br/>
              <br/>
              5. УСЛОВИЯ ОТКАЗА ОТ ТОВАРА<br/>
              <br/>
              После оформления заказа и его оплаты, в каждом отдельном случае, вы получаете право отказаться от Товара и
              запросить возврат денежных средств. Вы имеете право отказаться от оплаченных товаров, уведомив нас об этом
              в установленные сроки ТОЛЬКО ДО ПОЛУЧЕНИЯ ТОВАРА.<br/>
              <br/>
              От даты получения нами запроса на возврат зависит возможность возврата средств, а также сумма удержаний,
              связанных с возвратом. Вы понимаете и соглашаетесь с тем, что, если вы уже начали пользоваться товаром,
              возврат за него не возможен.<br/>
              <br/>
              Оформление возврата<br/>
              <br/>
              Для отказа от товара и оформления возврата, напишите нам по адресу makegameprofit@gmail.com или обратитесь
              в службу поддержки по телефону, указанному на сайте. Мы подтвердим получение запроса на возврат
              email-сообщением по адресу, указанному при оформлении заказа.<br/>
              <br/>
              Для оформления возврата, обязательно сообщите нам: ФИО и email, указанные при оформлении заказа; название
              Товара; дату заказа; информацию о платежах; причины отказа от товара, а также другую необходимую
              информацию.<br/>
              Вы понимаете, что, если вы не предоставите необходимую информацию, мы имеем право отказать вам в возврате
              и не рассматривать ваше обращение.<br/>
              <br/>
              Последствия отказа от товара<br/>
              <br/>
              Для возврата средств мы воспользуемся тем же способом платежа, который вы использовали при оплате товара.
              Только в некоторых случаях мы удержим из суммы возврата все дополнительные комиссии банков и платежных
              систем, связанные с возвратом платежа.<br/>
              <br/>
              Если вы уже пользовались товаром, или не пользовались товаром, но не по нашей вине или отказались от
              пользования товаром с нарушением сроков и установленного порядка разных для каждой категории, мы не
              возмещаем вам стоимость таких товаров<br/>
            </div>
            <h2>Политика конфиденциальности</h2>
            <div className="sPolicy__box">
              Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика» представляе собой правила
              использования <a href="/" target="_blank">https://bro-gamers.com/</a> (далее – «мы» и/или «Администрация»)
              данных интернет-пользователей (далее «вы» и/или «Пользователь»), собираемых с использованием сайта <a
              href="/" target="_blank">https://bro-gamers.com/</a> (далее – «Сайт»).<br/>
              1. Обрабатываемые данные<br/>
              1.1. Мы не осуществляем сбор ваших персональных данных с использованием Сайта.<br/>
              1.2. Все данные, собираемые на Сайте, предоставляются и принимаются в обезличенной форме (далее –
              «Обезличенные данные»).<br/>
              1.3. Обезличенные данные включают следующие сведения, которые не позволяют вас идентифицировать:<br/>
              1.3.1. Информацию, которую вы предоставляете о себе самостоятельно с использованием онлайн-форм и
              программных модулей Сайта, включая имя и номер телефона и/или адрес электронной почты.<br/>
              1.3.2. Данные, которые передаются в обезличенном виде в автоматическом режиме в зависимости от настроек
              используемого вами программного обеспечения.<br/>
              1.4. Администрация вправе устанавливать требования к составу Обезличенных данных Пользователя, которые
              собираются использованием Сайта.<br/>
              1.5. Если определенная информация не помечена как обязательная, ее предоставление или раскрытие
              осуществляется Пользователем на свое усмотрение. Одновременно вы даете информированное согласие на доступ
              неограниченного круга лиц к таким данным. Указанные данные становится общедоступными с момента
              предоставления и/или раскрытия в иной форме.<br/>
              1.6. Администрация не осуществляет проверку достоверности предоставляемых данных и наличия у Пользователя
              необходимого согласия на их обработку в соответствии с настоящей Политикой, полагая, что Пользователь
              действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в
              актуальном состоянии и получению всех необходимых согласий на ее использование.<br/>
              1.7. Вы осознаете и принимаете возможность использования на Сайте программного обеспечения третьих лиц, в
              результате чего такие лица могут получать и передавать указанные в п.1.3 данные в обезличенном виде.<br/>
              1.8. Состав и условия сбора обезличенных данных с использованием программного обеспечения третьих лиц
              определяются непосредственно их правообладателями и могут включать:<br/>
              данные браузера (тип, версия, cookie);<br/>
              данные устройства и место его положения;<br/>
              данные операционной системы (тип, версия, разрешение экрана);<br/>
              данные запроса (время, источник перехода, IP-адрес).<br/>
              1.9. Администрация не несет ответственность за порядок использования Обезличенных данных Пользователя
              третьими лицами.<br/>
              2. Цели обработки данных<br/>
              2.1. Администрация использует данные в следующих целях:<br/>
              2.1.1. Обработка поступающих запросов и связи с Пользователем;<br/>
              2.1.2. Информационное обслуживание, включая рассылку рекламно-информационных материалов;<br/>
              2.1.3. Проведение маркетинговых, статистических и иных исследований;<br/>
              2.1.4. Таргетирование рекламных материалов на Сайте.<br/>
              3. Требования к защите данных<br/>
              3.1. Администрация осуществляет хранение данных и обеспечивает их охрану от несанкционированного доступа и
              распространения в соответствии с внутренними правилами и регламентами.<br/>
              3.2. В отношении полученных данных сохраняется конфиденциальность, за исключением случаев, когда они
              сделаны Пользователем общедоступными, а также когда используемые на Сайте технологии и программное
              обеспечение третьих лиц либо настройки используемого Пользователем программного обеспечения
              предусматривают открытый обмен с данными лицами и/или иными участниками и пользователями сети
              Интернет.<br/>
              3.3. В целях повышения качества работы Администрация вправе хранить лог-файлы о действиях, совершенных
              Пользователем в рамках использования Сайта в течение 1 (Одного) года.<br/>
              4. Передача данных<br/>
              4.1. Администрация вправе передать данные третьим лицам в следующих случаях:<br/>
              Пользователь выразил свое согласие на такие действия, включая случаи применения Пользователем настроек
              используемого программного обеспечения, не ограничивающих предоставление определенной информации;<br/>
              Передача необходима в рамках использования Пользователем функциональных возможностей Сайта;<br/>
              Передача требуется в соответствии с целями обработки данных;<br/>
              В связи с передачей Сайта во владение, пользование или собственность такого третьего лица;<br/>
              По запросу суда или иного уполномоченного государственного органа в рамках установленной законодательством
              процедуры;<br/>
              Для защиты прав и законных интересов Администрации в связи с допущенными Пользователем нарушениями.<br/>
              5. Изменение Политики конфиденциальности<br/>
              5.1. Настоящая Политика может быть изменена или прекращена Администрацией в одностороннем порядке без
              предварительного уведомления Пользователя. Новая редакция Политики вступает в силу с момента ее размещения
              на Сайте, если иное не предусмотрено новой редакцией Политики.<br/>
              5.2. Действующая редакция Политики находится на Сайте в сети Интернет по адресу.<br/>
              Действующая редакция Политики от 24.01.2020 г.<br/>
            </div>
          </div>
        </section>
      </main>
      <Footer/>
    </div>
  )
}